// pages/test/test.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [
      ["LB_14807409482370", "", "1", "汉密顿抑郁量表", "汉密顿抑郁量表", "情绪评定", "25", "有抑郁症状的成人", "系统量表", "其他", "100", "", "5728622860898", "4", ""],
      ["LB_14809084743450", "", "2", "显性焦虑量表", "显性焦虑量表", "情绪评定", "50", "16岁及以上人群", "系统量表", "其他", "100", "", "5728622860898", "25", ""],
      ["LB_14809252605100", "", "3", "交流恐惧自陈量表", "交流恐惧自陈量表", "情绪评定", "24", "18岁及以上成年人", "系统量表", "其他", "100", "", "5728622860898", "43", ""],
      ["LB_14809270976120", "", "4", "焦虑自评量表", "焦虑自评量表", "情绪评定", "20", "18岁及以上成年人", "系统量表", "其他", "100", "", "5728622860898", "45", ""],
      ["LB_14809317554070", "", "5", "羞怯量表", "羞怯量表", "情绪评定", "13", "12岁及以上人群", "系统量表", "其他", "100", "", "5728622860898", "53", ""],
      ["LB_14809383668360", "", "6", "压抑量表", "压抑量表", "情绪评定", "40", "16岁及以上人群", "系统量表", "其他", "100", "", "5728622860898", "61", ""],
      ["LB_14809904178430", "", "7", "惧怕否定评价量表", "惧怕否定评价量表", "情绪评定", "30", "18岁及以上成年人", "系统量表", "其他", "100", "", "5728622860898", "67", ""],
      ["LB_14809953564280", "", "8", "抑郁自评量表", "抑郁自评量表", "情绪评定", "20", "具有抑郁症状的18岁及以上人群", "系统量表", "其他", "100", "", "5728622860898", "74", ""],
      ["LB_14809963390640", "", "9", "抑郁量表", "抑郁量表", "情绪评定", "60", "16岁及以上人群", "系统量表", "其他", "100", "", "5728622860898", "77", ""],
      ["LB_14810036793670", "", "10", "老年抑郁量表", "老年抑郁量表", "情绪评定", "30", "60岁以上老年人", "系统量表", "其他", "100", "", "5728622860898", "82", ""],
      ["LB_14810102652460", "", "11", "流调用抑郁自评量表", "流调用抑郁自评量表", "情绪评定", "20", "18岁及以上人群", "系统量表", "其他", "100", "", "5728622860898", "90", ""],
      ["LB_14810729214690", "", "12", "UCLA孤独量表", "UCLA孤独量表", "情绪评定", "20", "12岁以上", "系统量表", "其他", "100", "", "5728622860898", "112", ""],
      ["LB_14810774322550", "", "13", "妊娠压力量表", "妊娠压力量表", "情绪评定", "30", "孕妇及其丈夫", "系统量表", "其他", "100", "", "5728622860898", "121", ""],
      ["LB_14810780812010", "", "14", "艾森克情绪稳定性测验", "艾森克情绪稳定性测验", "情绪评定", "210", "18岁及以上成年人", "系统量表", "其他", "100", "", "5728622860898", "122", ""],
      ["LB_14810823631800", "", "15", "状态-特质焦虑问卷", "状态-特质焦虑问卷", "情绪评定", "40", "初中及以上文化程度的成年人", "系统量表", "其他", "100", "", "5728622860898", "127", ""],
      ["LB_14810889235820", "", "16", "情绪—社交孤独问卷", "情绪—社交孤独问卷", "情绪评定", "30", "16岁及以上", "系统量表", "其他", "100", "", "5728622860898", "128", ""],
      ["LB_14810906204190", "", "17", "情绪类型自测", "情绪类型自测", "情绪评定", "30", "16岁及以上", "系统量表", "其他", "100", "", "5728622860898", "129", ""],
      ["LB_14810922986790", "", "18", "爱丁堡产后抑郁量表（EPDS）", "爱丁堡产后抑郁量表（EPDS）", "情绪评定", "10", "产后6周的母亲", "系统量表", "其他", "100", "", "5728622860898", "131", ""],
      ["LB_14810966484030", "", "19", "自动思维问卷", "自动思维问卷", "情绪评定", "30", "18岁及以上人群", "系统量表", "其他", "100", "", "5728622860898", "138", ""],
      ["LB_14810979035220", "", "20", "贝克焦虑量表（BAI）", "贝克焦虑量表（BAI）", "情绪评定", "21", "有焦虑症状的成年人", "系统量表", "其他", "100", "", "5728622860898", "141", ""],
      ["LB_14810989136000", "", "21", "贝克抑郁自评量表（BDI）", "贝克抑郁自评量表（BDI）", "情绪评定", "13", "有抑郁症状的成年人", "系统量表", "其他", "100", "", "5728622860898", "143", ""],
      ["LB_14811195623120", "", "22", "汉密顿焦虑量表", "汉密顿焦虑量表", "情绪评定", "14", "有焦虑症状的人", "系统量表", "其他", "100", "", "5728622860898", "168", ""],
      ["LB_14811653436580", "", "23", "功能失调性态度问卷（DAS）", "功能失调性态度问卷（DAS）", "情绪评定", "40", "非文盲和非低教育人群", "系统量表", "其他", "100", "", "5728622860898", "174", ""],
      ["LB_14812003584540", "", "24", "Sarason考试焦虑量表", "Sarason考试焦虑量表", "情绪评定", "37", "12岁及以上学生群体", "系统量表", "其他", "100", "", "5728622860898", "195", ""],
      ["LB_14816261695850", "", "25", "孤独量表", "孤独量表", "情绪评定", "80", "在校大学生", "系统量表", "其他", "100", "", "5728622860898", "213", ""]
    ]
  },
  //事件处理函数
  bindViewTap: function () {
    wx.navigateTo({
      url: '../logs/logs'
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})